# Taps
tap "homebrew/bundle"

# Development
brew "act"
brew "actionlint"
brew "ansifilter"
brew "chezmoi"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "gitui"
brew "gnu-sed"
brew "go"
brew "hey"
brew "jq"
brew "mas"
brew "neovim"
brew "nkf"
brew "rsync"
brew "rustup"
brew "rust-analyzer"
brew "starship"
brew "tmux"
brew "tree"
brew "volta"
brew "wakatime-cli"

## Rust
brew "bat"
brew "fd"
brew "git-delta"
brew "grex"
brew "lsd"
brew "procs"
brew "ripgrep"
brew "sd"
brew "tldr"
brew "tokei"

# Desktop Software
cask "appcleaner"
cask "deepl"
cask "discord"
cask "docker"
cask "firefox"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "immersed"
cask "iterm2"
cask "maccy"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "slack"
cask "topnotch"
cask "visual-studio-code"
cask "windows-app"
cask "zoom"

# Hardware Support
cask "karabiner-elements"
cask "keyboardcleantool"

# Fonts
cask "font-consolas-for-powerline"
cask "font-noto-sans-jp"

# App Store
#mas "Be Focused - Focus Timer", id: 973134471
mas "Kindle", id: 302584613
mas "Bitwarden", id: 1352778147
mas "EasyRes", id: 688211836
mas "Keynote", id: 409183694
